# Pandas
Links:  
[Pandas Documentation](https://pandas.pydata.org/docs/)  
[Pandas datatyper](https://pbpython.com/pandas_dtypes.html)

In [18]:
import pandas as pd

## Series
[Link to doc on Series](https://pandas.pydata.org/docs/reference/api/pandas.Series.html#pandas.Series)  
[Link to user guide on data structures](https://pandas.pydata.org/docs/user_guide/dsintro.html)  
- Series är 1-dimensional
- DataFrames är 2-dimensional
- Varje kolumn i en DataFrame är en Serie.
- I de flesta fall ska alla element i en series vara av samma typ.
- Man kan som i numpy multiplicera en hel serie med ett annat tal utan att loopa
- Varje element har ett index, börjar på 0.
- I Series kan man ange egna index.
- Support av "label based indexing" ('sju')
- Icke unika index värden är tillåtna.
- Serier kan ha namn.

- Skapa en serie baserad på en lista.

In [15]:
fruits = pd.Series(['apple','pear','orange','melon','kiwi'])
fruits

0     apple
1      pear
2    orange
3     melon
4      kiwi
dtype: object

Om man skriver ut ett element får man inte dess index.

In [9]:
fruits[0] #

'apple'

Om man skriver ut flera element får man varje elements index.

In [10]:
fruits[:2] #

0    apple
1     pear
dtype: object

- I Series kan man ange egna index.
- Support av "label based indexing" ('sju')
- Icke unika index värden är tillåtna.
- Serier kan ha namn.

In [6]:
fruits = pd.Series(['apple','pear','orange','melon','kiwi'], index=[5,6,'sju',8,9])
print(fruits)
print(fruits['sju'])

5       apple
6        pear
sju    orange
8       melon
9        kiwi
dtype: object
orange

In [11]:
fruits.apply(str.upper)

0     APPLE
1      PEAR
2    ORANGE
3     MELON
4      KIWI
dtype: object

In [12]:
numbers = pd.Series([5,6,3])
numbers * 2

0    10
1    12
2     6
dtype: int64

In [13]:
fruits[[True,True,False,False,True]]

0    apple
1     pear
4     kiwi
dtype: object

### Läsa in en dict till DataFrame

In [14]:
data = {
    'Name':['Anders','Tomas','Maria'],
    'Age':[42,46,36]
}

df = pd.DataFrame(data)
df

     Name  Age
0  Anders   42
1   Tomas   46
2   Maria   36

### Läsa in list of dictionarys till DataFrame

In [15]:
data = [
    {'name':'Anders','age':42},
    {'name':'Tomas','age':46},
    {'name':'Maria','age':36}
]

df = pd.DataFrame(data)
df

     name  age
0  Anders   42
1   Tomas   46
2   Maria   36

In [17]:
df['name']

0    Anders
1     Tomas
2     Maria
Name: name, dtype: object

In [18]:
df['age']

0    42
1    46
2    36
Name: age, dtype: int64

In [19]:
df['age'] + 1 # ger en ny serie

0    43
1    47
2    37
Name: age, dtype: int64

In [20]:
df['age'] = df['age'] + 2 # för att addera till redan existerande df
df['age']

0    44
1    48
2    38
Name: age, dtype: int64

In [24]:
df['age'] > 40

0     True
1     True
2    False
Name: age, dtype: bool

In [25]:
df[df['age'] > 40]

     name  age
0  Anders   44
1   Tomas   48

In [26]:
str(df)

'     name  age\n0  Anders   44\n1   Tomas   48\n2   Maria   38'

In [27]:
print(df)

     name  age
0  Anders   44
1   Tomas   48
2   Maria   38